#ifndef __tree__
#define __tree__

//------------------------------------------------------------------------------
// tree.h - содержит описание дерева
//------------------------------------------------------------------------------

#include <fstream>
using namespace std;

# include "rnd.h"

//------------------------------------------------------------------------------
// дерево
struct tree {
    int64_t number;
};

// Ввод параметров дерево из файла
void In(tree &t, ifstream &ifst);

// Случайный ввод параметров дерева
void InRnd(tree &t);

// Вывод параметров дерево в форматируемый поток
void Out(tree &t, ofstream &ofst);

#endif //__tree__
